<a href="https://colab.research.google.com/github/yooste/SOLUX_summer_data/blob/master/2%EC%A3%BC%EC%B0%A8/pandas_chap11_0801.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [2]:
data_list = [{'yyyy-mm-dd':'2000-06-27'},
             {'yyyy-mm-dd':'2002-09-24'},
             {'yyyy-mm-dd':'2005-12-20'}]
df = pd.DataFrame(data_list, columns = ['yyyy-mm-dd'])
df

   yyyy-mm-dd
0  2000-06-27
1  2002-09-24
2  2005-12-20

In [10]:
# 연도를 추출하는 함수
def extract_year(column):
  return column.split("-")[0] # '-'로 나누어 첫번째 값을 return 한다

In [11]:
df['year'] = df['yyyy-mm-dd'].apply(extract_year) # extract_year로 추출된 연도가 새로운 column으로 생겼다.

In [12]:
df

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2002-09-24  2002
2  2005-12-20  2005

In [13]:
# 현재 연도와 추출된 연도의 차로 나이를 구하는 함수
def get_age(year, current_year):
  return current_year - int(year)

In [17]:
df['age'] = df['year'].apply(get_age, current_year=2020)
# apply의 인자로 함수 뿐만 아니라 다른 parameter도 집어 넣을 수 있다.
# 나이를 구하는 함수 get_age와 현재 연도인 2020을 같이 집어 넣는다.

In [15]:
df

   yyyy-mm-dd  year  age
0  2000-06-27  2000   20
1  2002-09-24  2002   18
2  2005-12-20  2005   15

In [18]:
# 나이를 소개하는 함수
def get_introduce(age, prefix, suffix):
  return prefix+str(age)+suffix

In [21]:
# 파라미터를 여러 개 보내는 법
df['introduce'] = df['age'].apply(get_introduce, prefix="I am ", suffix=" years old")
# get_introduce함수와 prefix, suffix 2개의 파라미터를 적용한다.

In [22]:
df

   yyyy-mm-dd  year  age          introduce
0  2000-06-27  2000   20  I am 20 years old
1  2002-09-24  2002   18  I am 18 years old
2  2005-12-20  2005   15  I am 15 years old

In [23]:
def get_introduce_2(row):
  return "I was born in "+str(row.year)+" my age is "+str(row.age)

In [24]:
df.introduce = df.apply(get_introduce_2, axis=1)
# df.introduce와 df['introduce']는 동일하다.
# axis=1으로 row에 있는 모든 정보를 활용할 수 있다.

In [25]:
df

   yyyy-mm-dd  year  age                        introduce
0  2000-06-27  2000   20  I was born in 2000 my age is 20
1  2002-09-24  2002   18  I was born in 2002 my age is 18
2  2005-12-20  2005   15  I was born in 2005 my age is 15